Revit 2027 API
MEPSystemType.Abbreviation Property
 Identifies the abbreviation, the short name, for the system type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Abbreviation { get; set; }
Public Property Abbreviation As String
	Get
	Set
public:
property String^ Abbreviation {
	String^ get ();
	void set (String^ value);
}
member Abbreviation : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MEPSystemType Class
Autodesk.Revit.DB Namespace